<?php

/**
 * @category   OpenCart
 * @package    SEO URL Generator FREE
 * @copyright  © Serge Tkach, 2017–2023, http://sergetkach.com/
 */

// Heading
$_['heading_title'] = 'SEO URL Generator FREE';

// Text
$_['text_extension'] = 'Розширення';
$_['text_success']   = 'Налаштування модуля SEO URL Generator FREE оновлені!';
$_['text_edit']      = 'Редагування модуля';
$_['button_save']    = 'Зберегти';
$_['button_cancel']  = 'Відміна';
$_['button_save_licence']  = 'Зберегти ліцензію';

$_['text_author']         = 'Автор';
$_['text_author_support'] = 'Підтримка';

$_['entry_licence'] = 'Код ліцензії';
$_['entry_status']  = 'Статус модуля';


// Success
$_['success']         = 'Налаштування модуля SEO URL Generator FREE оновлені';
$_['success_licence'] = 'Ліцензія успішно збережена!';


// Error
$_['error_permission'] = 'У вас немає прав для управління цим модулем!';
$_['error_warning']    = 'Помилка: Налаштування не збережені. Виправте зазначені в формі помилки і спробуйте зберегти знову!';
$_['error_licence']           = 'Помилка: Код ліцензії не дійсний!';
$_['error_licence_empty']     = 'Введіть код ліцензії!';
$_['error_licence_not_valid'] = 'Помилка: Код ліцензії не дійсний!';


// Part Settings
$_['text_part_settings'] = 'Налаштування';

$_['fieldset_base']         = 'Основні налаштування';
$_['entry_licence']         = 'Введіть ключ ліцензії';
$_['entry_system']          = 'Ви використовуєте систему'; // for OC 2.x only
$_['entry_limit']           = 'Кількість записів, які обробляються за за 1 крок при масової генерації';
$_['help_limit']            = 'Чим потужніший сервер, тим більше записів він зможе обробляти за 1 крок. І навпаки';
$_['entry_debug']           = 'Режим налагодження (тільки для розробників)';
$_['help_debug']            = 'Якщо при масової генерації є помилка, то логи можуть зрозуміти, на якому етапі вона відбувається. Логі записуються в папку ' . DIR_LOGS . '. Не забудьте вимкнути Режим налагодження після тестування';
$_['debug_0']               = 'Нe вести лог';
$_['debug_1']               = 'Error - записувати помилки при перевірці даних';
$_['debug_2']               = 'Info - записувати значущи дії';
$_['debug_3']               = 'Debug - записувати дані при значущих діях';
$_['debug_4']               = 'Trace - записувати все підряд';

$_['fieldset_stores']           = 'Налаштування для кожного магазину'; // for OC 3.x

$_['fieldset_translit']           = 'Транслітерація';
$_['entry_language_id']           = 'Вхідна мова'; // for OC 2.x only
$_['entry_translit_function']     = 'Правило транслітерації';
$_['entry_delimiter_char']        = 'Символ для поділу слів в SEO URL';
$_['help_delimiter_char']         = 'Даний символ буде замінювати некоректні символи, які можуть зустрічатися в назві. Так пропуск, знаки оклику та питання, кома та інші символи будуть замінені на обраний Символ для поділу слів';
$_['char_underscore']             = 'Знак підкреслення &quot;_&quot;';
$_['char_hyphen']                 = 'Дефіс &quot;-&quot;';
$_['entry_change_delimiter_char'] = 'Заміна Символу для поділу слів';
$_['help_change_delimiter_char']  = 'Зверніть увагу, що символи &quot;_&quot; и &quot;-&quot; вважаються однаково коректними для SEO UR. Однак, їх одночасне використання може виглядати не естетично з точки зору користувачів.';
$_['change_donot']                = 'Не замінювати символи &quot;-&quot; та &quot;_&quot;';
$_['change_underscore_to_hyphen'] = 'Замінювати &quot;_&quot; на &quot;-&quot;';
$_['change_hyphen_to_underscore'] = 'Замінювати &quot;-&quot; на &quot;_&quot;';
$_['entry_rewrite_on_save']       = 'Актуалізувати SEO URL при редагуванні';
$_['help_rewrite_on_save']        = 'При редагуванні товару (та ін сутностей) їх назви можуть змінюватися. В такому випадку старий SEO UR буде злегка не відповідати. <br><br>Якщо ввімкнути цю опцію, то при кожному редагуванні суті її SEO URL буде актуалізуватися, а старий SEO URL запишеться в список редиректів зі статусом 301.';
$_['title_custom_replace']        = 'Кастомні символи для заміни';
$_['help_custom_replace']         = 'Введіть по одному значенню на рядок';
$_['entry_custom_replace_from']   = 'Символ, який шукаємо';
$_['entry_custom_replace_to']     = 'Замінити на символ';

$_['fieldset_formulas']          = 'Формули для генерації SEO URL';
$_['entry_category_formula']     = 'Формула SEO URL Категорій';
$_['entry_product_formula']      = 'Формула SEO URL Товарів';
$_['entry_manufacturer_formula'] = 'Формула SEO URL Виробників';
$_['entry_information_formula']  = 'Формула SEO URL Інформаційних сторінок (в розділі Каталог -> Статті)';
$_['text_available_vars']        = 'Доступні змінні';
	$_['help_vars']                  = '* Між змінними слід використовувати символ роздільник слів. Наприклад:';
$_['or']                         = 'або';

$_['button_save_settings'] = 'Зберегти';

$_['error_formula_empty']     = 'Заповніть формулу для генерації SEO URL!';
$_['error_formula_less_vars'] = 'Недостатньо змінних для генерації унікальних SEO URL!';
$_['error_formula_pattern']   = 'У формулі допускається використання тільки заявлених <b>змінних </b>. Як роздільник використовується <b>Дефіс "-" або Знак підкреслення "_"</b>. Видаліть зайві символи такі як пробіл, крапка, кома, знаки оклику та питання, набір літер "html" та інше)!';

$_['error_custom_replace_to_not_1_char'] = 'У стовпці &quot;' . $_['entry_custom_replace_to'] . '&quot; має бути така ж кількість рядків, як і в стовпці &quot;' . $_['entry_custom_replace_from'] . '&quot;. Або Ви можете використати всього 1 загальний символ у правому стовпці для заміни символів з лівого стовпця.';


// Admin on Essences
$_['sug_button_generate'] = 'Згенерувати SEO URL';
$_['sug_text_redirects'] = 'Редіректи';
$_['sug_help_redirects'] = 'Необхідно вписувати SEO URL даної сутності без батьківської категорії';
$_['sug_button_add_redirect'] = 'Додати SEO URL для редиректу ';
$_['sug_button_delete_redirect'] = 'Видалити редирект ';
$_['sug_confirm_title'] = 'Підтвердіть дію!';
$_['sug_confirm_body'] = '<p>Ви впевнені, що хочете прибрати редирект?</p><p>Майте на увазі, що це е безповоротна дія, і може вплинути на випадання сторінки з пошуку. Якщо раптом Ви не зрозуміли сенс цих слів, то, будь ласка, проконсультуйтеся з тим, хто в Вашому проекті відповідає за SEO.</p>';
$_['sug_confirm_btn_yes'] = 'Прибрати редирект';
$_['sug_confirm_btn_no'] = 'Відміна';

$_['sug_redirects_error_validate'] = 'Введено некоректний SEO URL для редиректу!';
$_['sug_redirects_error_title'] = 'Помилка!';
$_['sug_redirects_error_empty'] = 'SEO URL для редиректу порожній!';
$_['sug_redirects_error_slash'] = 'SEO URL для редиректу містить косу лінію!';
$_['sug_redirects_error_protocol'] = 'SEO URL містить адресу сайту!';
$_['sug_redirects_error_html'] = 'SEO URL містить розширення .html - Найчастіше це невірно!';
$_['sug_redirects_error_common'] = 'SEO URL для редіректа повинен відповідати тим самим вимогам, що і основний SEO URL! Тобто, в SEO URL для редиректу не повинно бути адреси сайту, батьківської категорії, розширення .html - тільки SEO URL конкретної сутності ';


/* FREE VERSION
-------------------------------------------- */
$_['text_part_info'] = 'Інформація про модуль';
$_['text_about_title'] = 'Про модуль';
$_['text_about'] = '<p>Цей модуль, мабуть, самий "заморочений" модуль на тему SEO URL в OpenCart.</p>
				<p>На відміну від багатьох схожих рішень, <b>SEO URL Generator FREE by Serge Tkach</b> дозволяє Вам вписувати редіректи для товарів, категорій, виробників. Адже таке буває, що товару або категорії необхідно присвоїти інше посилання. У багатьох інших CMS подібний функціонал є з коробки. За допомогою даного модуля таке можливо і в OpenCart.</p>
				<p>Також модуль може "простежити" за тим, щоб SEO URL самі змінювалися в разі, коли Ви змінюєте назву товару. При цьому старий ЧПУ (який вже може знаходитися в результатах пошуку), автоматично буде перенаправляти на новий ЧПУ з перенаправленням 301.</p>';
$_['text_about_pro_title'] = 'Про платную версію модуля';
$_['text_about_pro'] = '<p>Платна версія модуля <b>SEO URL Generator PRO by Serge Tkach</b> дозволяє генерувати SEO URL не тільки для окремо взятого товару, а масово згенерувати ЧПУ для сотень або тисяч товарів, які вже є в магазині. Або які "прилетять" завтра при імпорті від постачальника. Масова генерація також може стати в нагоді в разі, якщо в Вашому магазині вже є ЧПУ, але вони морально застаріли (використовується нижнє підкреслення) або в принципі потрібно замінити їх на більш короткий варіант (наприклад, по product_id).</p>';